const mongooseUtils = require('./../modules/mongooseUtils.js');

mongooseUtils.startSession();
mongooseUtils.saveJoke({content: `Подходит мужик к милиционеру и спрашивает: "Хочешь я тебе анекдот политический расскажу?"
Тот отвечает: "Ты дурак? Я милиционер."
Мужик: "Ничего, я 2 раза расскажу."`});

mongooseUtils.saveJoke({content: `Босс знакомится с новым шофером:
— Как ваша фамилия?
— Меня зовут Лёша…
— Меня интересует ваша фамилия, потому, что я привык обращаться к шоферам по фамилии!
— Я думаю, что вам будет не удобно меня по фамилии называть…
— Меня не интересует, что ты думаешь!
— Моя фамилия — Любимый…
— Поехали, Лёша!`});

mongooseUtils.saveJoke({content: `Жена:
— У вас, у мужиков, на уме только секс, а нам, женщинам, нужно внимание и уход…
Mуж:
— Внимание!!! Я ухожу! `});

mongooseUtils.saveJoke({content: `Сидят два мужика за стойкой бара. Один из них цепляется к другому:
-Я спал с твоей матерью!
В баре наступает гробовая тишина, все ждут реакции второго. Тот молчит. Первый орёт ещё громче:
-Я спал с твоей матерью!
Второй:
-Иди домой, папа, ты пьян!`});

mongooseUtils.saveJoke({content: `Недавно производители программного обеспечения США сделали просто ошеломляющее открытие:
Оказывается, скорость чтения россиян в тысячи раз превышает скорость чтения американцев. Это стало очевидно после подсчета миллисекунд, за которые среднестатистический россиянин успевает прочитать пользовательское (лицензионное) соглашение и нажать кнопку «СОГЛАСЕН»…`});

mongooseUtils.saveJoke({content: `— Итак, молодой человек, где хотели бы служить?
— В ПВО! В ПВО МЕНЯ ВОЗЬМИТЕ! Я В ПВО СЛУЖИТЬ ХОЧУ!!!
— А с чего это у вас нервишки так сильно расшатаны, что кричите так? Со слухом еще смотрю проблемы начинаются…
— Я ВОЗЛЕ АЭРОПОРТА ЖИВУ. В ПВО МЕНЯ ВОЗЬМИТЕ! В ПВО!`});

mongooseUtils.saveJoke({content: `Муж с женой дома занимаются сексом. Утром их сосед, старик дядя Саша, говорит:
— Слушай, Николай! Вы ночью когда сексом занимаетесь, ваши крики и стоны по всему подъезду слышны, делайте это как-нибудь потише!
— А как потише?
— Рот жене скотчем залепи, что ли…
Ночь, муж скотчем заклеивает рот жене, и они занимаются сексом. После первого оргазма муж кричит:
— Дядь Саша, так хорошо?
— Да!
После второго оргазма:
— И так хорошо?
— Да!
И так несколько раз. Наконец старик нервно орёт:
— Коля, убери ты этот скотч со рта жены!
— Почему?
— Потому что весь дом думает, что это ты меня трахаешь!`});

mongooseUtils.saveJoke({content: `Жена нового русского заказывает доставку, приезжает водитель и два грузчика, разгружают газель, один из грузчиков идет за оплатой, 20 минут его нет - выходит счастливым, его спрашивают, чего лыбишься, он говорит, что ему та красотка м*нет сделала, второй грузчик без промедлений летит в квартиру, через 20 минут возвращается счастливый: "И мне!". тут водитель не выдерживается, вбегает в квартиру и начинает расстегивать штаны. Жена кричит: "Что вы себе позволяете?!". Водитель: "Как что? А м*нет?". Жена: "Вы из меня дуру то не делайте, муж ясно сказал: водителю 100$, а грузчикам х*й сосать".`});